morbos/ada/xml/LPC55S6x_mod2.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="PINT">
      <name>SECPINT</name>
      <description>Pin interrupt and pattern match (PINT)</description>
      <groupName>PINT</groupName>
      <baseAddress>0x40005000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SEC_GPIO_INT0_IRQ0</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>SEC_GPIO_INT0_IRQ1</name>
        <value>51</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>INPUTMUX</name>
      <description>Input multiplexing (INPUT MUX)</description>
      <groupName>INPUTMUX</groupName>
      <baseAddress>0x40006000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7B4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>7</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SCT0_INMUX[%s]</name>
          <description>Input mux register for SCT0 input</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>INP_N</name>
              <description>Input number to SCT0 inputs 0 to 6..</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>SCT_GPI0 function selected from IOCON register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>SCT_GPI1 function selected from IOCON register</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>SCT_GPI2 function selected from IOCON register</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>SCT_GPI3 function selected from IOCON register</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>SCT_GPI4 function selected from IOCON register</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>SCT_GPI5 function selected from IOCON register</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>SCT_GPI6 function selected from IOCON register</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>SCT_GPI7 function selected from IOCON register</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>T0_OUT0 ctimer 0 match[0] output</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>T1_OUT0 ctimer 1 match[0] output</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>T2_OUT0 ctimer 2 match[0] output</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>T3_OUT0 ctimer 3 match[0] output</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>T4_OUT0 ctimer 4 match[0] output</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>ADC_IRQ interrupt request from ADC</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>GPIOINT_BMATCH</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>USB0_FRAME_TOGGLE</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>USB1_FRAME_TOGGLE</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>COMP_OUTPUT output from analog comparator</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>I2S_SHARED_SCK[0] output from I2S pin sharing</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>I2S_SHARED_SCK[1] output from I2S pin sharing</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>I2S_SHARED_WS[0] output from I2S pin sharing</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>I2S_SHARED_WS[1] output from I2S pin sharing</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>ARM_TXEV interrupt event from cpu0 or cpu1</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>DEBUG_HALTED from cpu0 or cpu1</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>None</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>None</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>None</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>None</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>None</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>None</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>None</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>None</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMER0CAPTSEL[%s]</name>
          <description>Capture select registers for TIMER0 inputs</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>CAPTSEL</name>
              <description>Input number to TIMER0 capture inputs 0 to 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val0</name>
                  <description>CT_INP0 function selected from IOCON register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val1</name>
                  <description>CT_INP1 function selected from IOCON register</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>CT_INP2 function selected from IOCON register</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>CT_INP3 function selected from IOCON register</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>CT_INP4 function selected from IOCON register</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>CT_INP5 function selected from IOCON register</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>CT_INP6 function selected from IOCON register</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>CT_INP7 function selected from IOCON register</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>CT_INP8 function selected from IOCON register</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>CT_INP9 function selected from IOCON register</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>CT_INP10 function selected from IOCON register</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>CT_INP11 function selected from IOCON register</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>CT_INP12 function selected from IOCON register</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>CT_INP13 function selected from IOCON register</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>CT_INP14 function selected from IOCON register</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>CT_INP15 function selected from IOCON register</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>CT_INP16 function selected from IOCON register</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>None</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>None</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>None</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>USB0_FRAME_TOGGLE</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val21</name>
                  <description>USB1_FRAME_TOGGLE</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>COMP_OUTPUT output from analog comparator</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>I2S_SHARED_WS[0] output from I2S pin sharing</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>I2S_SHARED_WS[1] output from I2S pin sharing</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>None</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>None</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>None</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>None</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>None</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>None</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>None</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
